Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 这种一下到了菜市场的即视感是什么鬼？为什么收来的都是一群金钢啊？！还全都是女的！说好的只看灵根资质，带回来再慢慢挑选，全力往剑修的标准上靠呢？这里哪个像剑修了？！
en_us: Why do I suddeny feel like I''m in a market? Why are all of them iron barbies? They're all females! He had already said he only wanted them to look at people's spirit roots so that he could pick and choose those whom he wanted to recruit later on. How was he going to lead people to become quality sword cultivators now? None of them looked like sword cultivators!

source: 这种坑货，懒死算了！
en_us: This worthless creature can laze to death for all I care!

source: 这种控制不住，想吼几句卧槽，想骂几句尼玛，想操天操地操空气的话，除了沈萤，他还能跟谁说，跟谁说，跟谁说啊喂？
en_us: Apart from Shen Ying, who else could he talk with when he had the urge to shout some holy shits, scold a few darn its, and also to fuck this, fuck that, and fuck everything. Who else, who else, who else?

source: 这群人刚才在下面还打打杀杀的，此刻却宛如什么事都没有发生，和和气气的走来上来，各自将灵牌交了上去。
en_us: This bunch of people who were fighting and killing below a moment ago, walked up amiably, and handed over their Anima Token, as if nothing happened before.

source: 这群胆小怕事忘恩负义的小人，凭什么？！
en_us: How dare this bunch of cowardly, ungrateful people do something like this?

source: 这翊凌雪也很是奇怪，每天下午时分都会来到练功房，让杨管事把江逸叫出来对战一场。尽管每次对练都是输，她却乐此不疲，让武殿内的陪练和杨管事都很是怀疑，难道她看上了江逸？
en_us: Yi Lingxue was indeed a strange girl - she would come to the Technique Practising Room every afternoon and ask for Jiang Yi for a sparring match, and despite losing every single match, she never seemed to tire of it. This made the other sparring partners at the Martial Arts Hall as well as Manager Yang dubious: could it be that she had taken a fancy to Jiang Yi?

source: 这翊小姐实力只有铸鼎境四重，前天他才铸鼎境一重，凭借黑色元力她都不能碰触到一片衣角，今日他实力大涨，自然不用说了。
en_us: The power level of Young Mistress Yi was only at the fourth stafe of the Cast Tripod Realm. The day before, his power level was only at the first stage of the Cast Tripod Realm and already, when he relied on the power of black essence forces, she was unable to even touch the corner of his robes. Today, with his power having greatly expanded, naturally she would be unable to hit him.

source: 这话一出口，不单是奚秋，就连在场的大半修士脸色都有些黑了，转头看了旁边的孤月一眼，顿时就猜到了怎么回事。之前那三个上青界的人，来的时候是什么德行，大部分弟子都看到了。说着是帮助探寻秘境，还不是来抢资源的，想必在秘境中也没少对各派的修士动手。但结果很明显，后来踢到了铁板被反杀了。
en_us: At those words, not only Xi Qiu’s, but more than half of the cultivators' faces turned black. He looked over at Lonemoon and immediately guessed at what had happened. Previously, most of the disciples had witnessed the ill conduct of the three people from the Upper Azure World. While they claimed to help explore the mystic realm, they were actually here to fight for the resources, and probably also fought with many of the cultivators of the sects. Yet the outcome was obvious; apparently, all the fighting backfired and they were killed instead.

source: 这话什么意思？威胁吗？一个小小掌门也敢威胁郁家！郁海珩气得正要站起来，轩辕禹却连忙上前拉住了人，一边朝沈萤点头，一边呵呵笑着道。
en_us: What was that suppposed to mean? A small Sect Master threatening the Yu Family! Yu Hai Heng was so mad and was about to stand up when Xuan Yuanyu quickly went over to hold him back, smiling and nodding at Shen Ying.

source: 这还仅仅只是一丝黑色元力啊……
en_us: This was only a sliver of black essence force…

source: 这里对于整个聚珍阁的店员来说是禁地，能上顶层的不超过五人。
en_us: For all the staff of the Pearl Gathering Pavilion, this place was restricted. No more than five people were allowed to visit the top floor.

source: 这门口护卫眼中的畏惧和迟疑神情，尽管只是一闪而逝，江逸却看得清清楚楚，他灵机一动大步朝大门外走去，满脸张狂的望着那护卫冷笑道：“上啊？怎么不上了？”
en_us: Jiang Yi was able to see clearly the look of confusion and dread in the guard's eyes, even though it had only flashed past for a single moment. Struck with some inspiration, he walked towards the main door with big strides. With a face full of insolence, he glared at the guard and called coldly, "Come on and attack! Why don't you come over here and fight me?"

source: 这门掌法因为十分歹毒，中掌者如果不及时治疗，轻则变成废人重则致死。即便容易速成，但大多数自视甚高的大家族子弟都不屑去修炼，而这个江如风竟然因为一点小事，就使出全力，这是想废了他，或者想直接要了他的命？
en_us: This martial art technique was very vicious. If the victim was not healed in time, he would become handicapped if lucky, or die if his injuries were too severe. Even though it was easy to manifest, most Jiang Clan sons arrogantly saw themselves as important and would find it beneath them to practice this move. Yet Jiang Song was using his full force over a small matter—did he want to make Jiang Yi disabled, or did he directly want Jiang Yi's life?

source: 这黄参丹药力很弱，是用西山药田内的草参配合一些药草炼制而成，仅仅只有活血化瘀之功效。江逸本也没完全打算靠这低级丹药，吞服之后立即就运转江水决，开始疗伤。
en_us: The medicinal power of this yellow ginseng elixir was very weak—it was refined from the grass ginseng grown in the medicinal plantations in the Western Hills combined with some medicinal herbs, and only had the effect of improving blood circulation. Jiang Yi had no intention to rely fully on such a low-grade elixir—after taking the pill he immediately started circulating the Jiang Water Art technique to begin the healing process.

source: 这黑色元力只能增幅丹药的药力，不能单独疗伤。
en_us: This black essence force could only increase the medical healing power of elixirs, and not heal wounds on its own.

source: 远远的就看到一堆八九阶的大妖，围在山门口的阵法处撕吼着，跟一个黑衣男子对质，场面很是剑拔弩张。
en_us: From afar, they saw a group of eighth- and ninth-level demons surrounding the array at the entrance of the hill. They were shouting at a man dressed in black. The scene looked extremely tense.

source: 连忙双手结印，念出大段的法咒，一个金色的契约法阵顿时出现在了青蛟身下，金光开始朝着它全身蔓延。小青蛟没有反抗的意思，也不敢反抗。
en_us: He quickly used both of his hands to conjure the contract seal while he recited a long curse under his breath. A golden contract array appeared on the green wyrm's body as a flash of gold light began to spread throughout the wyrm's body. The wyrm stayed perfectly still, not daring to resist.

source: 连羿清也好奇的看了过来。
en_us: Even Yi Qing curiously waited for Shen Ying's answer.

source: 追来的众人见江逸竟下如此狠手，一时又气又怒，全加速狂奔，手中身上元力运转，从三面朝江逸攻击而去。
en_us: Upon seeing Jiang Yi act so brazenly and ferociously, the group of opponents who had rushed over were infuriated and in a rage. They all sped up and raced frantically as they circulated their bodily essence force into their hands, rushing to attack Jiang Yi from three sides.

source: 退一万步说，在没有GM的情况下，这种外挂玩家，发展成亲友，总比做对手要好得多。那么普及这个世界的常识，自然是做为亲友的基本义务。而做为一个穿越前辈，他想当然的以为对方跟自己一样，看过了那本书，知道了剧情才过来的。
en_us: Taking a step back, under the lack of an administration for the game, it would be more beneficial to befriend the cheat than to become an opponent. Passing on general knowledge about the world was certainly the basic responsibilities of a friend. As a transmigration senior, he had hoped that the other party was surely just like him, someone who had read the book and understood the storyline before transmigrating over.

source: 透过大殿上方的天井，看到天色逐渐暗了下来，江逸也不修炼了，好奇的开始打量四周，看到四周的练功房不时有公子小姐进进出出，看到偶尔有陪练被打得吐血爬了出来，那些公子小姐却冷漠地离去……
en_us: Through the skylight on the ceiling of the Great Hall, one could see the colours of the sky gradually turn darker over time. Jiang Yi had also decided to stop power cultivation and instead out of curiosity started to look around at his surroundings. He saw from time to time some young masters and mistresses walking in and out of the surrounding Technique Practising Rooms. He had also observed how occassionally some sparring partners crawled out of the rooms, vomiting blood from their injuries due to the fight, yet their partnering young masters and mistresses simply coldly walked past them and left...

source: 逐个击破的计划险些毁于一旦，好在羿清临时暴发了一波，硬撑了下来。幸运的是，这些游仙里有四个都清醒了过来，只是他们陷入心魔太久，比起三个家主来伤得更重。连行走都成问题了。
en_us: Their divide and conquer plan would have failed if Yi Qing had not activated all his reserves and held on. Fortunately, four of the traveling immortals had awakened, but as they had been in the demonic trance for a long time, they were in far worse shape than their three family patriarchs and they could barely walk.

source: 那一瞬间，羿清觉得她好像有些失望，失望什么？他没死？
en_us: At that moment, Yi Qing felt that she seemed disappointed. But what was she disappointed about? That he was still alive?

source: 那三个人是突然出现在玄天宗上空的，出场还伴着数道天音，背后的天空还残余着一个仿佛被撕裂的缺口，他们是划破虚空来的。
en_us: Those three people suddenly appeared above the Blackheaven Sect. Their entrance was accompanied by numerous heavenly sounds, and even the sky seemed to have been torn apart — they had arrived by tearing through the void.

source: 那上古秘境中到底有什么了不得的东西，能让资源本就丰富的上青界，不惜派了三个高阶修士来，其中居然还有一位游仙。
en_us: What could lie within that Ancient Mystic Realm for the Upper Azure World, which was already abundant in resources, to send three high level cultivators, one of whom was even a Traveling Immortal?

source: 那个人终于出现了！
en_us: That man has finally appeared!

source: 那个刚一上界，一人个打得五个游仙满地找牙，一天之内差点拆了他轩辕家的沈大仙！甚至都没人知道她具体强到了哪种可怕的地步。直到现在他连一点反抗想法都生不出来！
en_us: The one who had beaten up the five traveling immortals so badly when she just entered the upper world, and almost tore down the Xuan Yuan Family in a day - Great Immortal Shen! Moreover, no one knew roughly how powerful she actually was. Up till now, he did not even dare to think about retaliating!

source: 那个少年不轻狂？谁真的就不喜欢权势金钱美女，不喜欢受到万人敬仰，轰轰烈烈风风光光？江逸性格沉稳，但一旦冲动起来他什么都可以不顾，他骨子内还是潜藏着一股疯狂的火焰，一旦爆发出来那将可以燎原，比如在西山之上将江如虎打得不像人样，又比如在风月楼废了马飞。
en_us: Which young man was not defiant in his core? Was there really someone who would genuinely turn away from power, wealth, and beautiful women; who would shun the respect and awe of millions; who would dislike a life of grandeur and glory? Despite his mature and sensible temperament, Jiang Yi could also throw any and all caution to the wind once impulsiveness hit. In the end, there was still a fire of passion burning unbridled deep within him. Once erupted, this fire could set whole plains ablaze, as seen by that time when he had beaten Jiang Ruhu into a pulp at the Western Hills, and more recently, when he had rendered Ma Fei useless at Fengyue Brothel.

source: 那个很有名气的大学院江逸半点不感兴趣，因为对于他来说遥不可及。至于城内顶级公子小姐的八卦他也一点不好奇，转身就要江家大院走去。
en_us: Jiang Yi did not even have a shred of interest in the distinguished college as it was a place far beyond his reach. As for the gossip about the upper-class children, he was not interested in that either. Instead, he turned his body and was about to walk in the direction of the Jiang Residence Central Courtyard.

source: 那么问题来了，她不会炒啊！
en_us: But then the problem came — she did not know how to cook them!

source: 那些丹药里，居然有晋阶丹。这种丹药不限使用者的修为，可作用于高阶修士，甚至是化神修士的丹药，吃了可以直接提升修为。只是材料极为难得，有很多更是早已经在青界绝迹，根本没有办法练制出来。而玉鼎的密室中却有不止一瓶。
en_us: Among those elixirs, there were actually cultivation boosting pills. The use of these kinds of pills was not tied to the consumer's cultivation level; the pills could be taken by high-ranking cultivators and even by Soul Formation cultivators. Anyone who took the pills would immediately gain a boost in their cultivation level. However, the ingredients to make these pills were extremely rare, many of which had already ceased to exist in the Azure World; there was simply no way to refine them. Yet despite that, there were more than one bottle of these pills in Yu Ding’s secret chamber.

source: 那些奔跑中的阴兵和尸人，其黑甲、兵器以及身上的暗灰色符文同时闪耀起来，发出各色各样的流光，汇聚成一股股枯朽的死气，从四面八方朝天庭倾泻而去。
en_us: The running yin soldiers and zombies, as well as their black armors, weapons, and the greyish glowing runic patterns coruscated at the same time, producing all sorts of colored streams of light. From all four corners, they poured forward like a cadaveric torrent, moving toward the Heavenly Court.

source: 那些符文在四面八方浮现、闪亮，发出耀眼的光芒。
en_us: The runic patterns surfaced from all directions, flashing blinding lights.

source: 那人一愣，这才看向中间的人，眼神顿时一缩，脸上闪过一丝慌乱，“你是……橙雨？！你……你怎么会在这里？”
en_us: Startled, the man looked at the person at the center of the group. He suddenly retracted his gaze and a nervous expression flashed across his face. "You are… Qi Chengyu?! You… why are you here?"

source: 那人一愣，顿时僵在原地，还有这种操作？！
en_us: The man was made speechless by her logic. He had never thought of this alternative!

source: 那人指了指前面华元城的城门，御剑落了下去。
en_us: The man pointed to the Huayuan City gate which was just ahead and descended to the ground on his sword.

source: 那人明明有着让轩辕家从上青界消失的机会，就这么轻易的放过他们了？
en_us: That person had the ability to wipe the entire Xuan Yuan Family off the face of the Upper Azure World, yet she let them go so easily?

source: 那人的仙骨直接被踢断了，张口吐出口血，却仍是嘴硬不肯开口。
en_us: His immortal bones were broken. He spit out blood, but still refused to speak.

source: 那人直接转头看向羿清，“道友，秘境中机遇随缘，但是千叶草木灵，可不是秘境里那些无主之物。还请道友归还！”说完，他直接就朝羿清的方向走了两步。
en_us: The man turned around to face Yi Qing and said, "Fellow Daoist, there are indeed many treasures you could come across in the mystic realm that are free for the taking, but the Thousand Leaves Vegetation Spirit is definitely not one of them. It has a rightful owner. Please return it to us, Fellow Daoist!"

source: 那人眼里闪过一丝慌乱，却没有回答，似是极力隐瞒什么一样，转而威胁道，“你……你们，我不管用了什么手段抓到我的，但劝你们赶紧放开我，不然上界仙人发怒的后果你们承受不起。”
en_us: Panic flashed in the person's eyes, but he did not respond. He looked extremely suspicious, as if he was hiding something. Then, he began to threaten them, "You... All of you, I don't care what kind of methods you used to capture me, but I advise you to release me immediately or you would not be able to bear the wrath of the immortals from the Upper Realm."

source: 那人瞪了思羽一样，眼神更加不屑，“哼！区区一个凡人的灵气怎么伤得……”
en_us: He looked at Si Yu with disdain and said, "Pfft! A mere mortal - what damage can you..."

source: 那人笑得更加的猖狂，满脸兴奋的样子，“原本只想抢个小法器，没想到居然能见到此幡。你还蠢到将它带在身上！真以为，这个剑阵能困得住我！”
en_us: His laughter grew wilder, his face filled with excitement, "I had originally just wanted to snatch a small Dharma artifact, never did I expect to see such a gonfalon. You were even stupid enough to bring it along with you! You really thought that this sword array can hold me down!"

source: 那人轻笑一声，眼神一眯沉声道，“当日三位长老进入那秘境之时，为更方便的探查这个秘境，特求家主赐予轩辕家至宝一同前往。如今三位长老已死，此宝却下落不明，我等不该来问个清楚吗？”
en_us: The Traveling Immortal laughed slightly, and narrowing his eyes, he said, "That day, the three Elders entered the mystic realm to aid in the exploration of this mystic realm, and they specially requested for our family's treasure to be brought in with them. Now that three of them are dead, and this treasure is missing, aren't we supposed to find out what exactly happened?"

source: 那位翊家的大小姐，尽管他已经拒绝了几次了却百折不饶，天天准时准点的来找他。这让他很是无奈，但她是武殿的顾客，点名要江逸出战杨管事也没办法。
en_us: That young mistress of the Yi Family simply refused to give up no matter how many times Jiang Yi turned her down, coming here every day like clockwork to order him. Although Jiang Yi was exasperated, there was little he or Manager Yang could do, as she was a customer of the Martial Arts Hall after all.

source: 那你到底会什么啊喂？真的是来帮忙的吗？
en_us: What exactly do you know? Are you really here to help out?

source: 那修士明明被十几只高阶妖类围住，却没有露出半点害怕的样子，冷哼一声道，“我乃追魂楼楼主枫影，今日来此，只为找无敌派掌门讨回个公道，与别人无关，阻我者杀无赦！”
en_us: The cultivator was surrounded by over ten high-level demons, yet he did not seem in the least bit afraid. He laughed coldly and replied, "I'm the Tower Master of Soul Chasing Tower, Feng Ying. I came here today to seek justice from your Sect Master. This has nothing to do with the rest of you. I will kill whoever gets in my way!"

source: 那傻乎乎的猪将闻言一愣，认真思考了一番后，正要朝那座寂静无人的天庭冲进去时，忽然感觉虚空剧烈地波动了起来，让他那硕大的体型差点凭空摔倒！
en_us: The silly pig soldier was taken aback when he heard that. After seriously contemplating for a while, he came to a decision. Just as he was about to charge towards the silent and uninhabited Heavenly Court, he felt the void shake violently. His massive body nearly fell flat on the floor!

source: 那光亮了半刻才暗了下去，空中两人已经落回了地上，青亦张嘴吐出一口血，受伤不轻。而羿清更加的严重，手上的剑已经折断，浑身都是血迹，身上到处都是被烧焦的痕迹，站立不稳，单膝跪了下去，嘴里止不住的往外流血，岂是一个惨字可以形容。
en_us: After a couple of seconds, the light disappeared. Yi Qing and Qing Yi had fallen to the ground. The latter had spit out a mouthful of blood and he was obviously gravely injured, while Yi Qing was even more so. The sword which he held in his hands had already been broken, his entire body covered with wounds and burns. Unable to hold the weight of his body up any longer, he fell to his knees. Blood flowed uncontrollably out of his mouth. There was only one word to describe Yi Qing right now: tragic.

source: 那几个猎户以为他是仙人，对她谢了又谢。这回到是没邀她下山了，而且对她猎妖的行为大加赞赏。鼓励她多杀几只，以免它们吃人，并塞了她更多红薯。
en_us: The small group of hunters thought that she was a deity and thanked her profusely. This time she was not invited to leave the mountain. They praised her actions of slaughtering demons and encouraged her to kill more so as to prevent them from eating humans, all whilst stuffing more sweet potatoes towards her.

source: 那几十黑蝌蚪般的文字突然解散了队形，纷纷爪牙舞爪的朝他脑袋扑了上来，一个个咬他的身体，甚至还有想要钻入他眼睛和耳朵的！
en_us: The tadpole-like words suddenly abandoned their organized formation and ferociously flew towards his head in a massive swarm. Most latched on to his body, and some made to burrow into his eyes and ears!

source: 那句话，那声音仿佛有无穷魔力，居然让亿万冥军不由自主地安静了下来，纷纷停下了正在进行的动作。
en_us: The voice that delivered the sentence seemed to contain infinite charm. It silenced hundreds of millions of Netherworld soldiers and stopped their advance.

source: 那只妖王更近了，羿清这才看清，它身后还跟着一大串，小一圈的白色身影。还有别的兔妖！细一数居然有近二十个之多。
en_us: As the Demon Monarch came closer, Yi Qing finally had a clearer view. It was being followed by a bunch of slightly smaller white silhouettes; there were other rabbit demons! There were as many as up to 20 of them.

source: 那只巨大的血狐，突然吼了一声，不顾羿清布下的剑阵，九条尾巴直接往着剑峰上一扫，其中两条尾巴瞬间被截断，它却拼着鲜血淋淋，硬生生的冲了出来，往远处逃去。
en_us: Suddenly giving out a loud roar, the huge blood fox ignored the sword array that Yi Qing had set up and swept its nine tails directly toward the tip of his sword. Its two tails were instantly cut off, but despite the blood gushing out, it managed to force its way through the array and fly off into the distance.

source: 那只能赔钱了！
en_us: Then there was no choice but to pay for the damages!

source: 那叫一个气势如宏，声振寰宇。
en_us: Their united voices resonated within the hall.

source: 那叫郁红的女子一愣，脸上闪过一丝慌乱，立马又恢复，笑着道，“这位仙师，我们几个都是来自同一个村子，村中都是自幼开始修道，有修为很正常，之前确实无门无派。若是不信，大可一探我等的神识，看看有没有其它门派的印记？”
en_us: The lady named Yu Hong faltered for a moment and a tinge of panic flashed across her face before it immediately returned back to normal. She smiled and said, “Immortal Master. We are all from the same village and in the village, everyone learned cultivation from young which is why it is normal for us to have cultivation. We really did not come from any sect. If you do not believe it, you may check our Divine Perception to see if there are transmission marks of other sects."

source: 那可是魔窟，别说得跟上街买大白菜似的啊喂！
en_us: That’s a fiend den we’re going to. Don't talk as if we’re going to the streets to buy cabbage!

source: 那啥，你们是不是忘了我也在这里啊喂？
en_us: Hey, are you forgetting that I'm right here?

source: 那声音带着些兴灾乐祸之意，那道天光慢慢散去，不到片刻就露出一个身着白衣的身影，一身化神威压隐隐传来，手持一支玉笛法器。
en_us: The voice was mocking him. The light slowly faded and a man in a white robe stood in front of Yi Qing, holding a jade flute Dharma artifact in his hands. He felt the man's Soul Formation suppression.

source: 那女子仍是那要死不活的懒散样，长长的叹了口气……
en_us: However, the woman gave a long sigh while exuding that same languid attitude…

source: 那妹子刚出门不到五分钟，就急急忙忙的回来了，“掌门，下午的时候，印家少主在城西跟人发生了冲突，还打起来了，听闻是遇到了追魂楼的人。”
en_us: Within five minutes, the Sister came back running through the door. "Sect Master, The Young Master of the Yin Family got into a scuffle with someone this afternoon. They got into a huge fight. I heard it's the people from the Soul Chasing Tower."

source: 那威压只出现了一瞬，下一刻就已经收了回去，五位游仙中最中间的一位中年修士上前一步，扫视了在场的众人一圈。在羿清身上停了一下，眼里闪过一丝忌惮，这才出声道，“这位道友所言也不无道理，秘境凶险。机缘境遇确实全看个人造化，不存在出来后继续寻仇的道理。”至少明面上不行。
en_us: That suppressive aura only appeared for a while before it was immediately withdrawn. Of the five Traveling Immortals, the middle aged cultivator in the centre stepped forward and looked around at the people. His gaze stopped on Yi Qing, a tinge of fear flashing past his eyes, and he then said, "Fellow Daoist, what you said was not illogical. The encounters in the mystic realm are indeed dependent on each person's fate. There is no reason to seek revenge afterwards." At least not openly.

source: 那巨兽一下没啃到，到是直接在地上咬出了个大坑，似是被惹怒了，眼睛睁得更大。抬头找了找，然后直勾勾的看向沈萤，瞬间把她当成了抢萝卜的敌人，身上的鳞片片片炸开，张开大嘴朝她威胁似的吼了一声。
en_us: The beast stood back upright, its mouth full of soil. The radish had managed to escape and the beast's mouth was filled with soil, while the ground had a huge hole where the beast bit into it. Outraged, it widened its eyes. Looking around, his gaze settled on Shen Ying. To the beast, Shen Ying was now an enemy who stole its food from right under its nose. The scales on its body began to flare, and it bore its teeth in an attempt to intimidate Shen Ying.

source: 那座宅邸突然打开，一道人影从里面飞了出来，哐当一声，一把灵剑就插到了众人的后面，挡住了几人的退路。
en_us: The doors to the magnificent residence suddenly opened up as a figure came flying out. With a banging sound, a spirit sword pierced into the ground of the road behind the girls, blocking some of their escape routes.

source: 那急切的样子，怎么看都有点……过度兴奋？像极了各门派里第一次御剑的小弟子。
en_us: That urgent look of hers seemed to be a little… overly excited? Appearing just like those young disciples when they were having their first experience of sword-riding.

source: 那总管幽幽一笑，轻描淡写的说道：“这名画是从聚珍阁购得，花费十两紫金，我也不要你的多，原价赔偿就行！否则，嘿嘿……就算打死你们，我们也有地方说理去。”
en_us: The chief supervisor smiled faintly and, as though he was trying to play down the issue, said simply, "This artwork was purchased at Pearl Gathering Pavilion and cost some ten taels of purple gold. Look, I don't want much from you. All you need to do is to pay me back the original value of the artwork! Otherwise... hehe... even if we beat you two to death, we have the right of reason."

source: 那把伴随他征战一生，号令天下的火龙剑！
en_us: This was the Fire Dragon Sword that had accompanied him in battle his entire life! A sword that reigned supreme!

source: 那护卫一冲进来就看到三个拳影，自然本能的双手一架挡住面门，哪知江逸的真实拳身却是砸向他的左肩。
en_us: Upon seeing the three fist shadows the moment he burst in, the guard instinctively raised his arms to block the attack; however, Jiang Yi smashed his real fist towards his left shoulder.

source: 那掌事到是客气，回了一礼，打量了两人一眼才道，“的确，我珠宝阁的鉴宝会，需要几名修为高强的护卫。不知道友是？”
en_us: The steward was courteous and he returned the gesture. After looking at them for a moment, he said, "That's right, my Treasure Pavilion is having a treasure evaluation event, which requires a few strong cultivators as guards. Fellow Daoist is…?"

source: 那是一个穿着灰扑扑袍子的女子，双肩无力下搭，双眼无神还一拉一拉的往下掉，整个人都透着一股懒洋洋的气质，个子很矮又瘦，脸色还带着点腊黄。
en_us: It was a woman dressed in a gray robe. Her shoulders were slouched weakly and her spiritless eyes seemed to droop lowly. Her entire being seemed to effuse an aura of laziness. She had a short and skinny figure, and her face was a little sallow.

source: 那是一名漂亮的小姐，年纪看起来只有十六七岁，五官长得比小奴还要精致几分，一袭淡黄色的长裙将她玲珑有致的娇躯包裹地严严实实，她坐在群花围绕地雅阁内静静的捧着一本书观看，旁边一杯热茶热气飘绕，更给人一种淡雅出尘的气质，就像一朵花中之王，让群花都失去了颜色般。
en_us: She was a beautiful young lady, who seemed like she was aged just sixteen or seventeen, with facial features that were more delicate than Xiaonu by several levels. Dressed in a light-yellow long dress that wrapped tightly around her delicate body, she sat in the elegent pavilion that was surrounded by flowers, quietly reading a book held in her hands with a cup of hot tea next to her that had hot vapour swirling above. She gave off an air of elegence and perfection, like a queen amongst flowers, completely overshadowing all the other flowers surrounding her.

source: 那条蛟龙在空中游转了一圈，带着更加浓郁的黑气，突然朝下方俯冲了下来。一时间庞大的威压就从天际传了下来，易峰只觉得心口一痛，嘴里顿时传来一阵腥甜，体内的气息瞬间消散，脚下一颤，眼看着就要从空中摔下去。
en_us: The flood dragon turned several rouonds in the sky, carrying thick black Qi with it. Suddenly, it rushed down toward them. In moments, a strong suppressive force gushed toward the group. Yi Feng felt a sharp pain in his chest and tasted something weet in his mouth. The aura in his body suddenly dissipated and his legs gave way. He was falling down from the sky.
